# DB_Project / Python for Data Engineering - EDX

In [43]:
import sqlite3
import pandas as pd 
conn = sqlite3.connect('STAFF.db')

In [44]:

table_name = 'instructor'
attribute_list = ['id', 'fname', 'lname', 'city', 'ccode']

file_path = 'INSTRUCTOR.csv'
df = pd.read_csv(file_path, names = attribute_list)

In [45]:
df.to_sql(table_name, conn, if_exists = 'replace', index = False)
print("Table is ready")

Table is ready

In [46]:
query_statement = f"SELECT * FROM {table_name}"
query_output = pd.read_sql(query_statement, conn)
print(query_statement)
print(query_output)

SELECT * FROM instructor
    id    fname      lname      city ccode
0    1      Rav      Ahuja   TORONTO    CA
1    2     Raul      Chong   Markham    CA
2    3     Hima  Vasudevan   Chicago    US
3    4     John     Thomas  Illinois    US
4    5    Alice      James  Illinois    US
5    6    Steve      Wells  Illinois    US
6    7  Santosh      Kumar  Illinois    US
7    8    Ahmed    Hussain  Illinois    US
8    9    Nancy      Allen  Illinois    US
9   10     Mary     Thomas  Illinois    US
10  11  Bharath      Gupta  Illinois    US
11  12   Andrea      Jones  Illinois    US
12  13      Ann      Jacob  Illinois    US
13  14     Amit      Kumar  NewDelhi    IN

In [47]:
query_statement = f"SELECT fname FROM {table_name}"
query_output = pd.read_sql(query_statement, conn)
print(query_statement)
print(query_output)

SELECT fname FROM instructor
      fname
0       Rav
1      Raul
2      Hima
3      John
4     Alice
5     Steve
6   Santosh
7     Ahmed
8     Nancy
9      Mary
10  Bharath
11   Andrea
12      Ann
13     Amit

In [48]:
query_statement = f"SELECT COUNT(*) FROM {table_name}"
query_output = pd.read_sql(query_statement, conn)
print(query_statement)
print(query_output)

SELECT COUNT(*) FROM instructor
   COUNT(*)
0        14

In [49]:
data_dict = {'id' : [100],
'fname' : ['John'],}

data_append = pd.DataFrame(data_dict)
data_append.to_sql(table_name, conn, if_exists ='append', index = False)
print("Data appended successfully")

Data appended successfully

In [50]:
query_statement = f"SELECT fname FROM {table_name}"
query_output = pd.read_sql(query_statement, conn)
print(query_statement)
print(query_output)

SELECT fname FROM instructor
      fname
0       Rav
1      Raul
2      Hima
3      John
4     Alice
5     Steve
6   Santosh
7     Ahmed
8     Nancy
9      Mary
10  Bharath
11   Andrea
12      Ann
13     Amit
14     John

In [51]:
query_statement = f"SELECT COUNT(*) FROM {table_name}"
query_output = pd.read_sql(query_statement, conn)
print(query_statement)
print(query_output)

SELECT COUNT(*) FROM instructor
   COUNT(*)
0        15

In [52]:
conn.close()
print("Connection Closed")

Connection Closed

In [11]:
import sqlite3
import pandas as pd 
sql_conn = sqlite3.connect('STAFF.db')

In [13]:
table_name = 'departments'
attribute_list = ['dept', 'dept_name', 'manager', 'loc_id']

file_path = 'departments.csv'
df = pd.read_csv(file_path, names = attribute_list)

In [15]:
df.to_sql(table_name, sql_conn, if_exists = 'replace', index = False)

3

In [18]:
query_statement = f"SELECT * FROM {table_name}"
query_output = pd.read_sql(query_statement, sql_conn)
print(query_statement)
print(query_output)

SELECT * FROM departments
   dept        dept_name  manager loc_id
0     2  Architect Group    30001  L0001
1     5   Software Group    30002  L0002
2     7      Design Team    30003  L0003

In [19]:
pd.read_sql(query_statement, sql_conn)

   dept        dept_name  manager loc_id
0     2  Architect Group    30001  L0001
1     5   Software Group    30002  L0002
2     7      Design Team    30003  L0003

In [31]:
data_dict = {'dept' : [9], 'dept_name' : ['Quality Assurance'], 'manager' : [30010],}

In [32]:
data_append = pd.DataFrame(data_dict)
data_append.to_sql(table_name, sql_conn, if_exists='append', index=False)

1

In [33]:
pd.read_sql(query_statement, sql_conn)

   dept          dept_name  manager loc_id
0     2    Architect Group  30001.0  L0001
1     5     Software Group  30002.0  L0002
2     7        Design Team  30003.0  L0003
3     9  Quality Assurance      NaN   None
4     9  Quality Assurance  30010.0   None

In [34]:
query_statement = f"SELECT dept_name FROM {table_name}"
query_output = pd.read_sql(query_statement, sql_conn)

In [35]:
print(query_output)

           dept_name
0    Architect Group
1     Software Group
2        Design Team
3  Quality Assurance
4  Quality Assurance

In [38]:
query_statement = f"SELECT COUNT(*) FROM {table_name}"
query_output = pd.read_sql(query_statement, sql_conn)

In [41]:
print(query_output)

   COUNT(*)
0         5